//  ────────────────────────────────────────────────────────────
//                     ╔╗  ╔╗ ╔══╗      ╔════╗
//                     ║╚╗╔╝║ ╚╣╠╝      ║╔╗╔╗║
//                     ╚╗╚╝╔╝  ║║  ╔══╗ ╚╝║║╚╝
//                      ╚╗╔╝   ║║  ║╔╗║   ║║
//                       ║║   ╔╣╠╗ ║╚╝║   ║║
//                       ╚╝   ╚══╝ ╚══╝   ╚╝
//    ╔╗╔═╗                    ╔╗                     ╔╗
//    ║║║╔╝                   ╔╝╚╗                    ║║
//    ║╚╝╝  ╔══╗ ╔══╗ ╔══╗  ╔╗╚╗╔╝  ╔══╗ ╔╗ ╔╗╔╗ ╔══╗ ║║  ╔══╗
//    ║╔╗║  ║║═╣ ║║═╣ ║╔╗║  ╠╣ ║║   ║ ═╣ ╠╣ ║╚╝║ ║╔╗║ ║║  ║║═╣
//    ║║║╚╗ ║║═╣ ║║═╣ ║╚╝║  ║║ ║╚╗  ╠═ ║ ║║ ║║║║ ║╚╝║ ║╚╗ ║║═╣
//    ╚╝╚═╝ ╚══╝ ╚══╝ ║╔═╝  ╚╝ ╚═╝  ╚══╝ ╚╝ ╚╩╩╝ ║╔═╝ ╚═╝ ╚══╝
//                    ║║                         ║║
//                    ╚╝                         ╚╝
//
//    Lead Maintainer: Roman Kutashenko <kutashenko@gmail.com>
//  ────────────────────────────────────────────────────────────

import 'dart:io';

class YIoTProvision {
  // ---------------------------------------------------------------------------
  //
  //  Start device provision
  //
  static Future<bool> start() async {
    Map<String, String> envVars = Platform.environment;

    // Get home directory
    String homeDir = "";
    var h = envVars['HOME'];
    if (h != null) {
      homeDir = h!;
    }

    // Get credentials directory
    String credDir = homeDir;
    var c = envVars['YIOT_CRED'];
    if (c != null) {
      credDir = c!;
    }

    // Run Provisioning process
    final p = await Process.start('bash', ['-c', homeDir + '/start-yiot-factory-tool.sh ' + credDir]);
    await stdout.addStream(p.stdout);
    print('the end 😎');

    return false;
  }
}

// -----------------------------------------------------------------------------
